Catalogs/Образцы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Образцы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Образцы/Forms/ФормаШильдик/Ext/Form/Module.bsl
&НаКлиенте
Перем ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, СтркутураНастроекПечати, СтруктураВариантов, СтруктураПечати;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Образец", Образец);
	
	Если НЕ ЗначениеЗаполнено(Образец) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	НачальныеНастройки();
	ДанныеОбразца 				= ПолучитьДанныеОбразца(Образец);
	СтркутураНастроекПечати 	= ПолучитьСтруктуруПечати();
	ТекстНаименование 			= ДанныеОбразца.Наименование;
	СтруктураВариантов			= ПолучитьВариантыНастроек();

	ЗаполнитьВарианты();
	
	Элементы.УдалитьВариант.Доступность = СтруктураВариантов.Количество() > 0;
	
	Если ПустаяСтрока(ДанныеОбразца.Обработка) Тогда
	
		Элементы.ГруппаОбработка.ТолькоПросмотр = Истина;
		Элементы.Обработка.Видимость = Ложь;
	
	КонецЕсли;
	
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	
		Элементы.ГруппаМатериалы.ТолькоПросмотр = Истина;
		Элементы.Материалы.Видимость = Ложь;
	
	КонецЕсли;
	
	ПриИзмененииНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВарианты()

	Элементы.ВариантНастройки.СписокВыбора.Очистить();
	
	Для каждого х Из СтруктураВариантов Цикл
	
		Элементы.ВариантНастройки.СписокВыбора.Добавить(х.Ключ); 
		х.Вставить("Измененн", Ложь);
	
	КонецЦикла;
	
	Элементы.ВариантНастройки.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПечати()

	Возврат Справочники.Образцы.ПолучитьСтркутуруНастроекПечати()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьВариантыНастроек()

	Возврат Справочники.Образцы.ПолучитьВариантыНастроек()	

КонецФункции // ПолучитьСтруктуруПечати()
 
&НаСервереБезКонтекста
Функция ПолучитьДанныеОбразца(Образец)
		
    Возврат Справочники.Образцы.ПолучитьДанныеОбразца(Образец);
	
КонецФункции // ПолучитьДанныеОбразца()

&НаКлиенте
Процедура НачальныеНастройки()

	РазмерШрифтаНаименования 	= ?(РазмерШрифтаНаименования = 0, 	9,  РазмерШрифтаНаименования);
	РазмерШрифтаОбработка 		= ?(РазмерШрифтаОбработка = 0, 		8,  РазмерШрифтаОбработка);
	РазмерШрифтаМатериалы 		= ?(РазмерШрифтаМатериалы = 0, 		8,  РазмерШрифтаМатериалы);
	РазмерШКпоВысоте			= ?(РазмерШКпоВысоте = 0,			7,  РазмерШКпоВысоте);
	РазмерШКпоШирине			= ?(РазмерШКпоШирине = 0,			15, РазмерШКпоШирине);

КонецПроцедуры // НачальныеНастройки() 

&НаСервереБезКонтекста
Функция СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца = Неопределено)
	
	Справочники.Образцы.СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца);
	
Конецфункции

&НаКлиенте
Процедура ПриИзмененииНастроек()
	
	ЗаполнитьЗначенияСвойств(СтркутураНастроекПечати, ЭтаФорма);
	СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца);

КонецПроцедуры // ПриИзмененииНастроек()

&НаКлиенте
Процедура РазмерШрифтаНаименованияПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекстНаШтрихКодеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура МетериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШрифтаМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйНаименованиеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйОбработкаПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПолужирныйМатериалыПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьШКПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоВысотеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура РазмерШКпоШиринеПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРамкуПриИзменении(Элемент)
	ПриИзмененииНастроек();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Пример;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариантНастройки(Команда)

	ПослеВводаВарианта = Новый ОписаниеОповещения("ПослеВводаНаименованиеВарианта", ЭтаФорма);
	ПоказатьВводСтроки(ПослеВводаВарианта, "", "Наименование варианта", 100);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаНаименованиеВарианта(ИмяВарианта, ДполнительыеЗначения) Экспорт

	ИмяВарианта = СтрЗаменить(ИмяВарианта, " ", "_");
	ИмяВарианта = СтрЗаменить(ИмяВарианта, ".", "_");
	ИмяВарианта = СтрЗаменить(ИмяВарианта, ",", "_");
	ИмяВарианта = СтрЗаменить(ИмяВарианта, "!", "_");
	ИмяВарианта = СтрЗаменить(ИмяВарианта, """", "_");
	ИмяВарианта = СтрЗаменить(ИмяВарианта, "№", "_");
	
	Если ЗначениеЗаполнено(ИмяВарианта) Тогда
		
		Если Элементы.ВариантНастройки.СписокВыбора.НайтиПоЗначению(ИмяВарианта) = Неопределено Тогда
			Элементы.УдалитьВариант.Доступность = Истина;
			Элементы.ВариантНастройки.СписокВыбора.Добавить(ИмяВарианта);
		Иначе	
			ПоказатьПредупреждение(, "Вариант " + ИмяВарианта + " уже существует");
		КонецЕсли;	
		
	КонецЕсли;
	

КонецПроцедуры // ПослеВводаНаименованиеВарианта()

&НаКлиенте
Процедура УдалитьВариант(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВариант(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВариантНастройкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
